app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `activation_digest`) VALUES ('raveena', 'raveena@gmail.com', '$2a$10$iqVx8IxdLnZrLIyTCBfQl.IUgiaDZwugjTNVYmCRKC.e/j7atrt7C', '2016-03-04 05:52:33', '2016-03-04 05:52:33', '$2a$10$nrIyiKodepRy9uG9aGFdGexc4EJ5OPONbuJjNkpbJB/xq6U4ngoMO')